tutorials/heatTransfer/buoyantBoussinesqSimpleSolver/iglooWithFridges/0/T
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 265;

boundaryField
{
    ground
    {
        type            fixedValue;
        value           uniform 265;
    }

    igloo_region0
    {
        type            fixedValue;
        value           uniform 265;
    }

    twoFridgeFreezers_seal_0
    {
        type            fixedValue;
        value           uniform 303;
    }

    twoFridgeFreezers_herring_1
    {
        type            fixedValue;
        value           uniform 303;
    }
}

// ************************************************************************* //
