tutorials/heatTransfer/buoyantBoussinesqSimpleSolver/iglooWithFridges/0/epsilon
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    ground
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }

    igloo_region0
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }

    twoFridgeFreezers_seal_0
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }

    twoFridgeFreezers_herring_1
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
}


// ************************************************************************* //
