tutorials/heatTransfer/buoyantBoussinesqSimpleSolver/iglooWithFridges/0/kappat
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      kappat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ground
    {
        type            kappatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;
    }

    igloo_region0
    {
        type            kappatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;
    }

    twoFridgeFreezers_seal_0
    {
        type            kappatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;
    }

    twoFridgeFreezers_herring_1
    {
        type            kappatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
}


// ************************************************************************* //
