tutorials/heatTransfer/buoyantBoussinesqSimpleSolver/iglooWithFridges/0/p_rgh
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ground
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    igloo_region0
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    twoFridgeFreezers_seal_0
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    twoFridgeFreezers_herring_1
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
}

// ************************************************************************* //
